[
  {
  "id": "lanciano-750",
  "name": "Eucharistic Miracle of Lanciano",
  "location": {
    "city": "Lanciano",
    "country": "Italy",
    "coordinates": {
      "lat": 42.2300,
      "lng": 14.3900
    },
    "address": "Church of St. Francis (San Francesco), Lanciano"
  },
  "date": {
    "year": 750,
    "displayDate": "c. 750 A.D."
  },
  "type": "Eucharistic Miracle (Host transformed into Flesh; Wine into Blood)",
  "description": "During Mass, the consecrated Host became human Flesh and the wine became human Blood before the congregation.",
  "narrative": "Around the year 750 A.D., at the Church of St. Francis in Lanciano, a Basilian monk who doubted the Real Presence was celebrating Mass when, at the words of consecration, the Host visibly turned into Flesh and the wine into Blood. The transformation was witnessed by those present. The Flesh has remained intact through the centuries, and the Blood separated into five unequal clots that together weigh the same as each clot individually—an unexplained phenomenon. The relics were preserved and venerated, drawing pilgrims for generations. In the modern era, ecclesiastical authorities authorized scientific investigations to examine the relics while maintaining their devotional custody.",
  "scientificEvidence": "Extensive studies (notably in 1970–1971 and later reviews) identified the Flesh as human myocardial tissue (heart muscle) and the Blood as human blood type AB, with proteins and mineral composition consistent with fresh human blood; no preservatives were found, and the tissue showed characteristics of a living heart at the time of transformation.",
  "significance": "One of the most renowned and scientifically studied Eucharistic miracles, Lanciano has profoundly influenced Eucharistic devotion worldwide and serves as a cornerstone testimony to the Catholic doctrine of the Real Presence.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Lanciano",
    "Italy",
    "Flesh and Blood",
    "Real Presence",
    "Scientific Study"
  ]
},
  {
    "id": "buenos-aires-1996",
    "name": "Eucharistic Miracle of Buenos Aires",
    "location": {
      "city": "Buenos Aires",
      "country": "Argentina",
      "coordinates": {
        "lat": -34.6037,
        "lng": -58.3816
      },
      "address": "Parish of Santa María, Buenos Aires"
    },
    "date": {
      "year": 1996,
      "displayDate": "August 15, 1996 (investigation continued 1996–2006)"
    },
    "type": "Eucharistic Miracle (Host transformed into cardiac tissue)",
    "description": "A consecrated Host transformed into living human heart tissue and blood following proper Eucharistic handling.",
    "narrative": "Between 1992 and 1996, three Eucharistic miracles occurred at the parish of Santa María in Buenos Aires...",
    "scientificEvidence": "Forensic pathology, histology, and DNA testing identified the substance as living human cardiac muscle tissue...",
    "significance": "The miracle strongly supports Catholic teaching on the Real Presence of Christ in the Eucharist and was overseen by the future Pope Francis...",
    "hasStreetView": true,
    "wikiUrl": null,
    "images": [],
    "sources": ["miracolieucaristici.org"],
    "tags": ["Eucharistic Miracle", "Real Presence", "Buenos Aires", "Pope Francis", "Scientific Investigation", "Heart Tissue"]
  },

  {
  "id": "tumaco-1906",
  "name": "Eucharistic Miracle of Tumaco",
  "location": {
    "city": "Tumaco",
    "country": "Colombia",
    "coordinates": {
      "lat": 1.8083,
      "lng": -78.7647
    },
    "address": "Tumaco Island, Pacific Coast"
  },
  "date": {
    "year": 1906,
    "displayDate": "January 31, 1906"
  },
  "type": "Eucharistic Miracle (Blessed Sacrament halting natural disaster)",
  "description": "A tsunami caused by a powerful earthquake halted after a priest raised the Blessed Sacrament on the shore of Tumaco.",
  "narrative": "On January 31, 1906, a massive undersea earthquake off the Pacific coast triggered a devastating tsunami that struck many coastal regions. As the waters surged toward the small island of Tumaco, Fr. Gerardo Larrondo was urged by the terrified villagers to bring the Blessed Sacrament. Carrying the monstrance, he processed to the beach with the faithful as the enormous wave advanced inland. Standing before the sea, Fr. Larrondo raised the Blessed Sacrament and traced the sign of the cross. At that moment, the wave suddenly stopped, receded, and the waters returned to their normal level. Tumaco was spared total destruction, and the event was widely regarded as a miraculous intervention attributed to the Real Presence of Christ in the Eucharist.",
  "scientificEvidence": "Eyewitness testimony from clergy and townspeople documented the sudden and unexplained retreat of the tsunami despite ongoing seismic activity affecting surrounding regions.",
  "significance": "The miracle reinforced Catholic belief in the power of the Eucharist and became known internationally, with Fr. Larrondo receiving letters from around the world requesting prayers.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": ["miracolieucaristici.org"],
  "tags": [
    "Eucharistic Miracle",
    "Tumaco",
    "Tsunami",
    "Blessed Sacrament",
    "Natural Disaster",
    "Real Presence"
  ]
},
{
  "id": "ludbreg-1411",
  "name": "Eucharistic Miracle of Ludbreg",
  "location": {
    "city": "Ludbreg",
    "country": "Croatia",
    "coordinates": {
      "lat": 46.2528,
      "lng": 16.6144
    },
    "address": "Chapel of the Batthyány Castle, Ludbreg"
  },
  "date": {
    "year": 1411,
    "displayDate": "1411"
  },
  "type": "Eucharistic Miracle (Wine transformed into Blood)",
  "description": "During Mass, consecrated wine visibly transformed into Blood after a priest doubted the Real Presence.",
  "narrative": "In 1411, while celebrating Mass in the chapel of the Batthyány Castle in Ludbreg, a priest experienced doubt about the doctrine of transubstantiation. Immediately after the consecration, the wine in the chalice turned into visible Blood. Unsure how to proceed, the priest sealed the relic within the altar. News of the miracle soon spread, and pilgrims began arriving in Ludbreg. A Church commission later investigated the event, and in 1513 Pope Leo X approved public veneration of the Precious Blood, which he personally carried in procession through Rome. The relic has remained preserved through the centuries and is still venerated today. Each year, the town celebrates a week-long devotion known as “Sveta Nedjelja” (Holy Sunday) in remembrance of the miracle.",
  "scientificEvidence": "The Blood relic has remained preserved and intact for centuries and was formally examined and approved for veneration by ecclesiastical authorities.",
  "significance": "The miracle strongly affirmed belief in the Real Presence and received papal approval, becoming one of the most enduring and venerated Eucharistic miracles in Europe.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Ludbreg",
    "Precious Blood",
    "Transubstantiation",
    "Croatia",
    "Holy Sunday"
  ]
},
{
  "id": "chirattakonam-2001",
  "name": "Eucharistic Miracle of Chirattakonam",
  "location": {
    "city": "Chirattakonam",
    "country": "India",
    "coordinates": {
      "lat": 8.6570,
      "lng": 76.7930
    },
    "address": "St. Mary’s Malankara Catholic Church, Chirattakonam, Kerala"
  },
  "date": {
    "year": 2001,
    "displayDate": "April 28, 2001"
  },
  "type": "Eucharistic Miracle (Image of Christ appeared on Host)",
  "description": "The face of Christ visibly appeared on a consecrated Host during Mass.",
  "narrative": "On April 28, 2001, during Mass at St. Mary’s Malankara Catholic Church in Chirattakonam, Fr. Thomas Pathickal noticed a mysterious spot forming on a consecrated Host shortly after the consecration. As Mass continued, the spot gradually developed into a clear image resembling the face of Jesus Christ. The Host was reverently set aside and later examined by Church authorities. The faithful who viewed the Host reported deep spiritual impact. After careful investigation, the Syro-Malankara Catholic Church officially recognized the event as a Eucharistic miracle and authorized public veneration of the Host.",
  "scientificEvidence": "The miracle involves a visible image rather than physical transformation; ecclesiastical investigation focused on authenticity, continuity of the image, and theological consistency rather than laboratory testing.",
  "significance": "This miracle strengthened Eucharistic devotion in India and affirmed Catholic belief in the Real Presence, particularly within the Syro-Malankara Catholic Church.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Chirattakonam",
    "India",
    "Image of Christ",
    "Real Presence",
    "Syro-Malankara Church"
  ]
},
{
  "id": "morne-rouge-1902",
  "name": "Eucharistic Miracle of Morne-Rouge",
  "location": {
    "city": "Morne-Rouge",
    "country": "Martinique",
    "coordinates": {
      "lat": 14.7703,
      "lng": -61.1394
    },
    "address": "Parish Church of Morne-Rouge, Martinique"
  },
  "date": {
    "year": 1902,
    "displayDate": "May 8, 1902"
  },
  "type": "Eucharistic Miracle (Apparition of Christ and protection from natural disaster)",
  "description": "An apparition of Jesus and His Sacred Heart appeared in the Host as the village was spared from a volcanic eruption.",
  "narrative": "On May 8, 1902, the volcano Mount Pelée erupted violently, instantly destroying the nearby city of Saint-Pierre. That same day, the village of Morne-Rouge, located between Saint-Pierre and the volcano, was mysteriously spared. During Eucharistic adoration, many faithful witnessed an apparition of Jesus Christ and His Sacred Heart appearing in the consecrated Host exposed in the monstrance. In fear and repentance, the villagers rushed to confession, received Holy Communion, and remained in prayer. The Blessed Sacrament was later reposed, and the apparition ceased. Morne-Rouge was preserved from destruction during this eruption, though a later eruption on August 30, 1902 eventually destroyed the village, reinforcing the belief that its earlier salvation was a moment of divine mercy.",
  "scientificEvidence": "The miracle is based on multiple eyewitness testimonies describing the visible apparition of Christ in the Eucharist and the unexplained preservation of the village during the initial volcanic eruption.",
  "significance": "The event emphasized Eucharistic faith, repentance, and divine mercy, becoming a powerful testimony to the Real Presence and God’s intervention during moments of catastrophe.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Morne-Rouge",
    "Martinique",
    "Volcanic Eruption",
    "Sacred Heart",
    "Real Presence"
  ]
},
{
  "id": "saint-andre-de-la-reunion-1902",
  "name": "Eucharistic Miracle of Saint-André de la Réunion",
  "location": {
    "city": "Saint-André",
    "country": "France (La Réunion)",
    "coordinates": {
      "lat": -20.9633,
      "lng": 55.6503
    },
    "address": "Parish Church of Saint-André, La Réunion"
  },
  "date": {
    "year": 1902,
    "displayDate": "January 26, 1902"
  },
  "type": "Eucharistic Miracle (Image of Christ appeared on Host)",
  "description": "The face of Jesus appeared on the consecrated Host and was witnessed for many hours by large crowds.",
  "narrative": "On January 26, 1902, at the parish church of Saint-André on the island of La Réunion, Abbot Henry Lacombe was celebrating Mass when, during Eucharistic adoration, the face of Jesus appeared on the consecrated Host exposed in the monstrance. The apparition was clearly visible and lasted for several hours. Thousands of faithful came to witness the phenomenon, including journalists and clergy. The image changed over time, at moments showing Christ crowned with thorns and later appearing as a crucifix. After Eucharistic Benediction and the chanting of the Tantum Ergo, the vision disappeared. Abbot Lacombe later testified publicly about the miracle during the Eucharistic Congress of Angoulême in 1904 and to groups of priests during retreats in France.",
  "scientificEvidence": "The event is supported by extensive eyewitness testimony from clergy, faithful, and journalists who observed the apparition over several hours; the Church evaluated the credibility of witnesses and consistency of accounts.",
  "significance": "The miracle greatly strengthened Eucharistic devotion and belief in the Real Presence, drawing thousands to adoration and becoming widely known beyond the island of La Réunion.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Saint-André",
    "La Réunion",
    "Image of Christ",
    "Real Presence",
    "Eucharistic Adoration"
  ]
},
{
  "id": "tixtla-2006",
  "name": "Eucharistic Miracle of Tixtla",
  "location": {
    "city": "Tixtla",
    "country": "Mexico",
    "coordinates": {
      "lat": 17.5676,
      "lng": -99.3985
    },
    "address": "Parish of Saint Mary of the Assumption, Diocese of Chilpancingo–Chilapa"
  },
  "date": {
    "year": 2006,
    "displayDate": "October 21, 2006"
  },
  "type": "Eucharistic Miracle (Host bleeding; cardiac tissue identified)",
  "description": "A consecrated Host began to exude blood that was later identified as living human cardiac tissue.",
  "narrative": "On October 21, 2006, during a spiritual retreat in Tixtla within the Diocese of Chilpancingo–Chilapa, a consecrated Host began to exude a reddish substance while being handled during Eucharistic adoration. The phenomenon continued over time. Ecclesiastical authorities initiated a thorough investigation, and between 2009 and 2012 multiple independent scientific analyses were conducted. The results were presented publicly in 2013 and confirmed that the substance originated from within the Host. On October 12, 2013, Bishop Alejo Zavala Castro formally recognized the supernatural character of the events, declaring the bleeding Host of Tixtla a divine sign affirming the Real Presence of Jesus Christ in the Eucharist.",
  "scientificEvidence": "Laboratory analyses identified the substance as human blood of type AB containing hemoglobin, DNA, intact white and red blood cells, active macrophages, and living cardiac muscle tissue (myocardium). Histopathological and immunohistochemical studies confirmed the tissue was heart muscle with signs of vitality, including mesenchymal cells and recovery trades, and demonstrated that the blood flowed from the interior of the Host rather than being applied externally.",
  "significance": "The miracle provides one of the most extensively documented modern Eucharistic miracles, offering strong theological and scientific support for Catholic belief in the Real Presence of Christ in the Eucharist.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Tixtla",
    "Mexico",
    "Bleeding Host",
    "Cardiac Tissue",
    "Real Presence"
  ]
},
{
  "id": "eten-1649",
  "name": "Eucharistic Miracle of Eten",
  "location": {
    "city": "Eten",
    "country": "Peru",
    "coordinates": {
      "lat": -6.9089,
      "lng": -79.8642
    },
    "address": "Church of Santa María Magdalena, Eten"
  },
  "date": {
    "year": 1649,
    "displayDate": "June 2, 1649"
  },
  "type": "Eucharistic Miracle (Apparition of the Child Jesus in the Host)",
  "description": "The Child Jesus appeared in a consecrated Host exposed for public adoration.",
  "narrative": "On June 2, 1649, during the solemn exposition of the Blessed Sacrament in honor of Corpus Christi at the port town of Eten, Peru, the Franciscan friar Jerome de Silva Manrique exposed the Eucharist in the monstrance. At the end of the service, a radiant image of the Child Jesus appeared in the Host, with light shining from His face and shoulders. The faithful present witnessed the apparition. A second apparition occurred weeks later on July 22, during celebrations for St. Mary Magdalene, in which the Divine Child again appeared in the Host, accompanied by three small white hearts united together, symbolizing the Holy Trinity. The apparitions lasted about fifteen minutes and were carefully documented by ecclesiastical authorities. Since that time, devotion to the Divine Child of Eten has continued, drawing pilgrims annually.",
  "scientificEvidence": "The miracle consists of visible apparitions witnessed by clergy and the faithful; Church authorities evaluated testimonies and preserved the accounts without recourse to laboratory analysis.",
  "significance": "The miracle fostered lasting devotion to the Divine Child of Eten and reinforced belief in the Real Presence of Christ in the Eucharist throughout Peru and beyond.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Eten",
    "Peru",
    "Child Jesus",
    "Real Presence",
    "Corpus Christi"
  ]
},
{
  "id": "santarem-1266",
  "name": "Eucharistic Miracle of Santarém",
  "location": {
    "city": "Santarém",
    "country": "Portugal",
    "coordinates": {
      "lat": 39.2362,
      "lng": -8.6850
    },
    "address": "Church of St. Stephen (Igreja de Santo Estêvão), Santarém"
  },
  "date": {
    "year": 1266,
    "displayDate": "February 16, 1266"
  },
  "type": "Eucharistic Miracle (Host transformed into bleeding Flesh and Blood)",
  "description": "A consecrated Host began to bleed and transformed into Flesh and Blood after being stolen and hidden.",
  "narrative": "According to a document commissioned by King Alfonso IV in 1346, on February 16, 1266, a woman in Santarém, distressed by jealousy toward her husband, sought help from a sorceress who instructed her to steal a consecrated Host for a love potion. After receiving Communion, she removed the Host and hid it in a linen cloth, which immediately became stained with Blood. At home, the Host began to gush Blood, and during the night brilliant rays of light illuminated the room from a drawer where it was kept. The husband, witnessing the phenomenon, confronted his wife, who confessed the sacrilege. The following day, the Host was returned in solemn procession to the Church of St. Stephen, where it continued to bleed for three days. In 1340, when the priest opened the tabernacle, the beeswax reliquary containing the Host was found broken, replaced by a crystal vessel containing Blood mixed with wax. The relic has been preserved and venerated ever since, with renewed emissions of Blood and visions of Christ reported over the centuries.",
  "scientificEvidence": "Numerous canonical investigations and studies were carried out over the centuries; the relics of Flesh and Blood have remained preserved and are still venerated today.",
  "significance": "Considered one of the most important Eucharistic miracles alongside Lanciano, the miracle received papal recognition and indulgences and has been a major center of Eucharistic devotion for centuries.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Santarém",
    "Portugal",
    "Bleeding Host",
    "Flesh and Blood",
    "Real Presence"
  ]
},
{
  "id": "ettiswil-1447",
  "name": "Eucharistic Miracle of Ettiswil",
  "location": {
    "city": "Ettiswil",
    "country": "Switzerland",
    "coordinates": {
      "lat": 47.1517,
      "lng": 8.0219
    },
    "address": "Shrine of the Eucharistic Miracle, Ettiswil"
  },
  "date": {
    "year": 1447,
    "displayDate": "May 23, 1447"
  },
  "type": "Eucharistic Miracle (Host miraculously divided and surrounded by light)",
  "description": "A stolen Host was found divided into seven pieces arranged like a flower and surrounded by a vivid light.",
  "narrative": "On May 23, 1447, a consecrated Host was stolen from the parish church of Ettiswil by Anna Vögtli. Unable to carry it further, she discarded it near a fence among nettles. The Host was later discovered by Margaret Schulmeister, a swineherd, who observed that her animals refused to approach the spot. With witnesses present, the Host was seen divided into seven pieces arranged like a radiant flower and surrounded by intense light. When the parish priest arrived to recover the Host, six pieces were lifted, but the central piece adhered firmly to the ground before everyone’s eyes. Interpreting this as a divine sign, it was decided to build a chapel on that very spot. The six pieces were taken to the church and became objects of great veneration. Numerous miracles were reported, and the chapel and altar were consecrated on December 28, 1448.",
  "scientificEvidence": "The event is documented in the official 'Protocol of Justice' compiled on July 16, 1447, containing sworn testimonies and detailed descriptions of the phenomenon.",
  "significance": "The miracle became a major center of pilgrimage in Switzerland, received papal indulgences, and strengthened devotion to the Real Presence in the Eucharist.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Ettiswil",
    "Switzerland",
    "Miraculous Host",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "betania-1991",
  "name": "Eucharistic Miracle of Betania",
  "location": {
    "city": "Betania (Cúa)",
    "country": "Venezuela",
    "coordinates": {
      "lat": 10.1616,
      "lng": -66.8845
    },
    "address": "Shrine of Betania, Cúa; relic preserved in Los Teques"
  },
  "date": {
    "year": 1991,
    "displayDate": "December 8, 1991"
  },
  "type": "Eucharistic Miracle (Bleeding Host with cardiac-like pulsation)",
  "description": "During Mass, a consecrated Host began to bleed and was later observed pulsating like a heart.",
  "narrative": "On December 8, 1991, while celebrating Mass in the chapel of the Shrine of Betania in Cúa, Father Otty Ossa Aristizábal noticed that the consecrated Host was bleeding during the consecration. The Host was reverently preserved and later transferred to the city of Los Teques, where it is kept at the convent of the Augustinian Recollect Nuns of the Sacred Heart of Jesus for perpetual adoration. Over time, numerous prodigious events were associated with the Host. One notable event involved a young American pilgrim who filmed the Host visibly pulsating like a heart while it was exposed for adoration. The phenomenon drew widespread attention and devotion from pilgrims in Venezuela and abroad.",
  "scientificEvidence": "Ecclesiastical investigations reported that the blood was of human origin and of blood type AB, consistent with findings in other recognized Eucharistic miracles; observations noted that the blood flowed from a specific area of the Host without staining the remainder.",
  "significance": "The miracle strengthened Eucharistic devotion in Venezuela, becoming a major pilgrimage site and reinforcing belief in the Real Presence of Christ in the Eucharist.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Betania",
    "Venezuela",
    "Bleeding Host",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "fiecht-1310",
  "name": "Eucharistic Miracle of Fiecht",
  "location": {
    "city": "Fiecht (St. Georgenberg)",
    "country": "Austria",
    "coordinates": {
      "lat": 47.3167,
      "lng": 11.6667
    },
    "address": "Monastery of St. Georgenberg-Fiecht, Inn Valley"
  },
  "date": {
    "year": 1310,
    "displayDate": "1310"
  },
  "type": "Eucharistic Miracle (Wine transformed into Blood)",
  "description": "During Mass, the consecrated wine changed into Blood and overflowed the chalice.",
  "narrative": "In 1310, at the monastery of St. Georgenberg-Fiecht in the Inn Valley, a priest was troubled by doubts concerning the Real Presence of Christ in the Eucharist. Immediately after the consecration, the wine in the chalice changed into visible Blood, which began to boil and overflow. The abbot, monks, and numerous faithful present witnessed the phenomenon and reverently consumed part of the Precious Blood, preserving the remainder in the tabernacle. News of the miracle spread quickly, drawing pilgrims to the monastery. After ecclesiastical investigation, the miracle was declared authentic, and devotion to the Precious Blood flourished throughout the region. Centuries later, chronicles attest that the Blood remained fresh and intact, and it is preserved to this day in a reliquary at the monastery.",
  "scientificEvidence": "Historical chronicles and ecclesiastical investigations documented the transformation and long-term preservation of the Precious Blood, which was reported to remain fresh centuries after the event.",
  "significance": "The miracle strengthened belief in the Real Presence, became a major center of pilgrimage in Tyrol, and fostered enduring devotion to the Precious Blood of Christ.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Fiecht",
    "Austria",
    "Precious Blood",
    "Real Presence",
    "Monastic Shrine"
  ]
},
{
  "id": "seefeld-1384",
  "name": "Eucharistic Miracle of Seefeld",
  "location": {
    "city": "Seefeld",
    "country": "Austria",
    "coordinates": {
      "lat": 47.3302,
      "lng": 11.1873
    },
    "address": "Church of St. Oswald, Seefeld in Tyrol"
  },
  "date": {
    "year": 1384,
    "displayDate": "Holy Thursday, 1384"
  },
  "type": "Eucharistic Miracle (Bleeding Host and supernatural intervention)",
  "description": "A consecrated Host began to bleed after a nobleman attempted to receive an oversized Host during Mass.",
  "narrative": "In 1384, during the Holy Thursday Mass in Seefeld, Oswald Milser, Lord of Schlosberg, demanded to receive Communion with the large Host reserved for the celebrant priest. As he approached the altar to receive it, the pavement beneath him began to tremble and cracked open, causing him to sink into the floor while grasping the altar. The priest immediately withdrew the Host from Milser’s mouth, at which point the trembling ceased and living blood began to drip from the Host. Numerous witnesses observed the miracle, and news quickly spread throughout the region. The blood-stained Host was preserved and exposed for veneration in the Church of St. Oswald, which became a major pilgrimage destination. Emperor Maximilian I himself showed great devotion to the miracle.",
  "scientificEvidence": "The event is supported by extensive eyewitness testimony recorded by ecclesiastical authorities and preserved through centuries of devotion and pilgrimage.",
  "significance": "The miracle reinforced reverence for the Eucharist, corrected abuses motivated by pride, and strengthened belief in the Real Presence throughout Austria and beyond.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Seefeld",
    "Austria",
    "Bleeding Host",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "weiten-raxendorf-1411",
  "name": "Eucharistic Miracle of Weiten-Raxendorf",
  "location": {
    "city": "Weiten-Raxendorf",
    "country": "Austria",
    "coordinates": {
      "lat": 48.2906,
      "lng": 15.2486
    },
    "address": "Parish Church of Weiten; Chapel at the site of the miracle"
  },
  "date": {
    "year": 1411,
    "displayDate": "1411"
  },
  "type": "Eucharistic Miracle (Host divided yet united by bleeding flesh)",
  "description": "A stolen Host was found glowing, divided into two pieces yet united by threads of bleeding flesh.",
  "narrative": "In 1411, during a period of frequent Host thefts in Austria, a thief broke into the sacristy of the parish church in Weiten and stole a consecrated Host, hiding it in his glove. While traveling through the valley toward Spitz, his horse suddenly stopped and could not be moved. Without being noticed, the Host fell from the glove to the ground. Several days later, a pious woman named Mrs. Scheck passed by the spot and saw the Host shining with a brilliant light. Upon lifting it, she discovered that it was divided into two parts but still united by threads of bleeding flesh. Deeply moved, she built a small chapel at her own expense on the site. As news spread, pilgrims began to arrive in great numbers, and a larger church was later constructed to accommodate the growing devotion to the miraculous relic.",
  "scientificEvidence": "The miracle is supported by detailed historical accounts and eyewitness testimony describing the luminous Host and its physical condition.",
  "significance": "The event strengthened Eucharistic devotion in the region, led to the establishment of a major pilgrimage site, and reinforced belief in the Real Presence of Christ in the Eucharist.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Weiten-Raxendorf",
    "Austria",
    "Bleeding Host",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "bois-seigneur-isaac-1405",
  "name": "Eucharistic Miracle of Bois-Seigneur-Isaac",
  "location": {
    "city": "Bois-Seigneur-Isaac",
    "country": "Belgium",
    "coordinates": {
      "lat": 50.6123,
      "lng": 4.3841
    },
    "address": "Monastery of Bois-Seigneur-Isaac, Chapel of the Holy Blood"
  },
  "date": {
    "year": 1405,
    "displayDate": "1405 (public veneration approved 1413–1414)"
  },
  "type": "Eucharistic Miracle (Bleeding Host staining the corporal)",
  "description": "A consecrated Host bled during Mass and stained the corporal, which has been preserved for veneration.",
  "narrative": "In 1405, during Mass at Bois-Seigneur-Isaac, the consecrated Host adhered to the corporal and began to bleed, staining it with Blood. The phenomenon continued over several days, with the Blood spreading across the cloth. Ecclesiastical authorities opened a formal investigation, collecting testimonies from witnesses. On May 3, 1413, the Bishop of Cambrai, Pierre d’Ailly, authorized public devotion to the Holy Relic and established a solemn procession, first held in 1414. On January 13, 1424, Pope Martin V approved the construction of the monastery. The blood-stained corporal is still preserved and exposed for veneration in the Chapel of the Holy Blood, and the site remains a destination for pilgrims.",
  "scientificEvidence": "The miracle is documented through canonical investigations and eyewitness testimony; the blood-stained corporal has been preserved over centuries and remains intact.",
  "significance": "The miracle received episcopal and papal approval, led to the foundation of a monastery, and became a lasting center of Eucharistic devotion in Belgium.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Bois-Seigneur-Isaac",
    "Belgium",
    "Bleeding Host",
    "Holy Blood",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "bruges-1256",
  "name": "Eucharistic Miracle of Bruges (Most Precious Blood of Jesus)",
  "location": {
    "city": "Bruges",
    "country": "Belgium",
    "coordinates": {
      "lat": 51.2089,
      "lng": 3.2242
    },
    "address": "Basilica of the Holy Blood (Basiliek van het Heilig Bloed), Bruges"
  },
  "date": {
    "year": 1256,
    "displayDate": "c. 1250–1256"
  },
  "type": "Eucharistic Miracle (Relic of the Precious Blood of Christ)",
  "description": "A relic venerated as the Most Precious Blood of Jesus has been preserved and publicly honored in Bruges since the 13th century.",
  "narrative": "The oldest documents concerning the Holy Blood of Bruges date back to 1256. According to historical tradition, the relic of the Precious Blood of Christ was preserved among the Passion relics in Constantinople and came into the possession of Baldwin IX, Count of Flanders, after the city was conquered during the Fourth Crusade. The relic was later sent to Bruges, Baldwin’s homeland. While an older tradition attributed its arrival to Count Diederik van den Elzas during the Second Crusade, modern investigations indicate the relic likely arrived around 1250 from Constantinople. The Holy Blood has since been preserved in a crystal vial dated to the 11th century and housed in the Basilica of the Holy Blood. Its veneration gave rise to the famous annual Procession of the Holy Blood, held on the Feast of the Ascension, during which the citizens of Bruges reenact biblical scenes and the arrival of the relic.",
  "scientificEvidence": "Analyses of the crystal vial date it to the 11th century and confirm its origin near Constantinople; the relic itself has been preserved intact and continuously venerated.",
  "significance": "The Holy Blood of Bruges is one of the most revered Eucharistic-related relics in Europe and has inspired centuries of devotion, pilgrimage, and one of the most renowned religious processions in the Catholic world.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Bruges",
    "Belgium",
    "Precious Blood",
    "Relic",
    "Procession of the Holy Blood",
    "Real Presence"
  ]
},
{
  "id": "brussels-1370",
  "name": "Eucharistic Miracle of Brussels",
  "location": {
    "city": "Brussels",
    "country": "Belgium",
    "coordinates": {
      "lat": 50.8467,
      "lng": 4.3525
    },
    "address": "Cathedral of St. Michael and St. Gudula, Brussels"
  },
  "date": {
    "year": 1370,
    "displayDate": "Good Friday, 1370"
  },
  "type": "Eucharistic Miracle (Bleeding Hosts after desecration)",
  "description": "Consecrated Hosts bled after being slashed with knives during a desecration.",
  "narrative": "In 1370, following the theft of consecrated Hosts in Brussels, desecrators gathered on Good Friday and slashed the Hosts with knives as an act of rebellion against the Catholic faith. Immediately, living blood flowed from the wounded Hosts. Terrified, the perpetrators entrusted the Hosts to a Catholic merchant, who revealed the events to the curate of the Church of Notre Dame. The Hosts were solemnly taken in procession to the Cathedral of St. Michael and St. Gudula. The Duke of Brabant condemned the desecrators, and the miraculous Hosts became objects of public veneration. Over the centuries, the miracle was commemorated through reliquaries, tapestries, and especially a series of stained-glass windows installed between 1436 and 1870, many donated by Belgian royalty and noble families.",
  "scientificEvidence": "The miracle is documented through contemporaneous accounts, canonical investigations, and enduring artistic testimonies including reliquaries and stained-glass cycles depicting the events.",
  "significance": "The miracle became a major religious and cultural symbol for Brussels and Belgium, strengthening Eucharistic devotion and leaving a lasting artistic and devotional legacy.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Brussels",
    "Belgium",
    "Bleeding Host",
    "Real Presence",
    "Stained Glass",
    "Pilgrimage Site"
  ]
},
{
  "id": "herentals-1412",
  "name": "Eucharistic Miracle of Herentals",
  "location": {
    "city": "Herentals",
    "country": "Belgium",
    "coordinates": {
      "lat": 51.1766,
      "lng": 4.8325
    },
    "address": "Cathedral of St. Waldetrudis (Sint-Waldetrudiskerk), Herentals; field site of De Hegge shrine"
  },
  "date": {
    "year": 1412,
    "displayDate": "1412 (recognized January 2, 1414)"
  },
  "type": "Eucharistic Miracle (Recovered Hosts found intact and radiant)",
  "description": "Previously stolen Hosts were found intact after days in the open, arranged in the form of a cross and surrounded by light.",
  "narrative": "In 1412, several consecrated Hosts stolen from Herentals were later discovered after eight days in a field near a rabbit burrow. Despite exposure to rain and weather, the Hosts were found perfectly intact, glowing with a brilliant light and arranged in the shape of a cross. The discovery moved the faithful deeply. Annual commemorations developed, including processions featuring paintings depicting the miracle and a commemorative Mass celebrated at the site known as De Hegge, where a small shrine was built. The relics and artistic testimonies are preserved in Herentals, especially at the Cathedral of St. Waldetrudis.",
  "scientificEvidence": "The miracle is attested by historical records and eyewitness testimony noting the intact condition of the Hosts after prolonged exposure and their radiant appearance.",
  "significance": "The event strengthened Eucharistic devotion in the region, led to enduring public commemorations, and became an important local pilgrimage tradition in Belgium.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Herentals",
    "Belgium",
    "Recovered Hosts",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "herkenrode-hasselt-1317",
  "name": "Eucharistic Miracle of Herkenrode–Hasselt",
  "location": {
    "city": "Herkenrode–Hasselt",
    "country": "Belgium",
    "coordinates": {
      "lat": 50.9307,
      "lng": 5.3325
    },
    "address": "Church of St. Quintinus (Sint-Quintinuskathedraal), Hasselt; former Abbey of Herkenrode"
  },
  "date": {
    "year": 1317,
    "displayDate": "July 25 – August 1, 1317"
  },
  "type": "Eucharistic Miracle (Bleeding Host with apparition of Christ)",
  "description": "A consecrated Host became stained with blood and later revealed the face of Christ crowned with thorns.",
  "narrative": "On July 25, 1317, the pastor of Viversel carried a consecrated Host to a sick parishioner. While the priest was hearing confession, a family member briefly handled the pyx containing the Host. When the priest later opened the pyx, he found the Host stained with blood and adhered to the linen. Alarmed, he sought counsel and was directed to bring the Host to the Abbey of Herkenrode. On August 1, 1317, along the journey extraordinary signs were reported, and upon arrival at the Benedictine monastery, the Host was shown to many witnesses. At that moment, the face of Christ crowned with thorns appeared on the Host, attested by numerous observers. The relic was placed in a reliquary and exposed for public veneration, and it was credited on several occasions with protecting the monastery from fire. In 1804, the relic was transferred to the Church of St. Quintinus in Hasselt, where it remains venerated today.",
  "scientificEvidence": "Across the centuries, multiple ecclesiastical examinations were conducted, including investigations in the 18th century by the Apostolic Nuncio Carafa, the Bishop of Liège, and later by the Archbishop of Malines, confirming the extraordinary preservation of the Host and the blood stains.",
  "significance": "The miracle became a major focus of Eucharistic devotion in the region, inspired enduring public veneration and processions, and remains one of Belgium’s most important medieval Eucharistic miracles.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Herkenrode",
    "Hasselt",
    "Belgium",
    "Bleeding Host",
    "Apparition of Christ",
    "Real Presence",
    "Pilgrimage Site"
  ]
},
{
  "id": "liege-1246",
  "name": "Institution of the Feast of Corpus Christi",
  "location": {
    "city": "Liège",
    "country": "Belgium",
    "coordinates": {
      "lat": 50.6326,
      "lng": 5.5797
    },
    "address": "Sanctuary of Saint Juliana of Cornillon, Liège"
  },
  "date": {
    "year": 1246,
    "displayDate": "1246 (universal feast established 1264)"
  },
  "type": "Eucharistic Event (Vision leading to universal feast)",
  "description": "Mystical visions received by Saint Juliana of Cornillon led to the establishment of the Feast of Corpus Christi.",
  "narrative": "In the early 13th century, Blessed Juliana of Cornillon, an Augustinian nun near Liège, experienced repeated visions of a full moon marked by a dark spot. Through divine revelation, she understood the moon to represent the life of the Church and the dark spot the absence of a feast dedicated solely to honoring the Holy Eucharist. She reported these visions to Church authorities, including Jacques Panteléon, Archdeacon of Liège. In 1246, Bishop Robert of Thourotte instituted a diocesan feast in honor of the Blessed Sacrament, celebrated for the first time in 1249. In 1264, Jacques Panteléon—now Pope Urban IV—extended the Feast of Corpus Christi to the entire Catholic Church through the papal bull *Transiturus de hoc mundo* and commissioned Saint Thomas Aquinas to compose the liturgical texts for the feast.",
  "scientificEvidence": "The event is based on documented mystical visions and authoritative ecclesiastical actions rather than physical or laboratory evidence.",
  "significance": "The visions at Liège gave rise to the universal Feast of Corpus Christi, one of the most important liturgical celebrations affirming the doctrine of the Real Presence of Christ in the Eucharist.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Event",
    "Liège",
    "Belgium",
    "Corpus Christi",
    "Saint Juliana of Cornillon",
    "Real Presence",
    "Church History"
  ]
},
{
  "id": "middleburg-lovanio-1374",
  "name": "Eucharistic Miracle of Middleburg–Lovanio",
  "location": {
    "city": "Middleburg (Middelburg)",
    "country": "Belgium",
    "coordinates": {
      "lat": 51.2350,
      "lng": 3.7530
    },
    "address": "St. Peter’s Church, Middleburg; relic later preserved in Louvain (Leuven)"
  },
  "date": {
    "year": 1374,
    "displayDate": "1374"
  },
  "type": "Eucharistic Miracle (Host transformed into bleeding Flesh)",
  "description": "During Holy Communion, the consecrated Host changed into bleeding Flesh in the priest’s mouth.",
  "narrative": "In 1374, at St. Peter’s Church in Middleburg, a woman known for her deep piety invited her household to prepare spiritually for Easter through penance and confession. One servant, Jan, who had not been to confession for many years and lived a dissolute life, reluctantly attended Mass and approached Holy Communion. As soon as he received the consecrated Host on his tongue, it transformed into bleeding Flesh. A particle fell from his mouth, and blood dripped onto the altar cloth. The priest immediately recognized the miracle. Jan repented sincerely, confessed his sins, and amended his life, remaining devoted to the Eucharist until his death. After thorough investigation, the Archbishop approved the cult of the miracle. A portion of the Precious Relic was later given as a gift to Jean de Gheest, confessor of the Archbishop, and preserved in Louvain by the Augustinian Fathers, while another portion remained in St. Peter’s Church in Middleburg.",
  "scientificEvidence": "The miracle is supported by extensive historical documentation, eyewitness testimony, and a monograph written in 1905 by historian Joseph Wils of the University of Louvain, citing contemporary documents and sworn accounts.",
  "significance": "The miracle reinforced belief in the Real Presence, inspired profound repentance and conversion, and received formal ecclesiastical approval, becoming a lasting focus of Eucharistic devotion in Belgium.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Middleburg",
    "Lovanio",
    "Belgium",
    "Bleeding Host",
    "Flesh and Blood",
    "Real Presence",
    "Conversion"
  ]
},
{
  "id": "st-mary-of-egypt-600s",
  "name": "Eucharistic Miracle of St. Mary of Egypt",
  "location": {
    "city": "Jordan River (Desert of Transjordan)",
    "country": "Egypt / Holy Land",
    "coordinates": {
      "lat": 31.8366,
      "lng": 35.5546
    },
    "address": "Jordan River crossing; Desert east of the Jordan"
  },
  "date": {
    "year": 600,
    "displayDate": "7th century"
  },
  "type": "Eucharistic Miracle (Miraculous reception of Holy Communion)",
  "description": "St. Mary of Egypt miraculously crossed the Jordan River to receive Holy Communion after decades of desert penance.",
  "narrative": "This Eucharistic miracle is connected to the life of St. Mary of Egypt, who lived as a hermit in the desert for forty-seven years in repentance and prayer. According to the account written by Bishop Sophronius of Jerusalem in the 7th century, St. Mary met the monk Zosimus and asked him to bring her Holy Communion the following year. When Zosimus returned, he saw St. Mary cross the Jordan River by walking on the water to reach him. After receiving Confession and Holy Communion from Zosimus, she asked him to return the next year. When he did, he found her body lying peacefully in the desert. A lion helped Zosimus dig her grave, and she was buried as a saintly witness to repentance, holiness, and reverence for the Eucharist.",
  "scientificEvidence": "The miracle is based on early hagiographical testimony recorded by Bishop Sophronius of Jerusalem, preserved consistently in Eastern and Western Christian tradition.",
  "significance": "The event highlights the centrality of the Eucharist in Christian life, demonstrating repentance, sanctity, and the supernatural power granted through reverence for Holy Communion.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "St. Mary of Egypt",
    "Egypt",
    "Jordan River",
    "Holy Communion",
    "Desert Hermit",
    "Real Presence",
    "Early Church"
  ]
},
{
  "id": "scete-300-500",
  "name": "Eucharistic Miracle of Scete",
  "location": {
    "city": "Scete (Wadi El Natrun)",
    "country": "Egypt",
    "coordinates": {
      "lat": 30.3667,
      "lng": 30.3000
    },
    "address": "Desert of Scete (Wadi El Natrun), monastic region of the Desert Fathers"
  },
  "date": {
    "year": 400,
    "displayDate": "3rd–5th centuries"
  },
  "type": "Eucharistic Miracle (Vision of the Infant Jesus at Consecration)",
  "description": "During the Eucharistic consecration, the Infant Jesus appeared on the bread and Blood flowed into the chalice.",
  "narrative": "The account of this Eucharistic miracle dates back to the early centuries of Christianity and is preserved in the sayings of the Fathers of the Desert who lived in Scete after the example of St. Anthony the Abbot. A monk expressed doubts about the Real Presence of Jesus Christ in the bread and wine consecrated at Mass, claiming they were only symbols. After the consecration, the Infant Jesus was visibly seen resting on the bread, and three companion monks witnessed the same apparition. According to another ancient account, an angel appeared holding a sword and pierced the Child, causing Blood to flow into the chalice. When the doubting monk approached Communion, the angel gave him flesh and blood instead of bread and wine. Terrified, the monk professed his faith in the Real Presence, after which the flesh returned to the form of bread, and he received Communion reverently. The miracle deeply strengthened Eucharistic faith among the Desert Fathers.",
  "scientificEvidence": "The miracle is preserved through early monastic writings and oral tradition recorded in the apophthegmata of the Desert Fathers rather than scientific or laboratory analysis.",
  "significance": "One of the earliest recorded Eucharistic miracles, it powerfully affirmed belief in the Real Presence among the early monastic communities and influenced Christian Eucharistic theology.",
  "hasStreetView": true,
  "wikiUrl": null,
  "images": [],
  "sources": [
    "miracolieucaristici.org"
  ],
  "tags": [
    "Eucharistic Miracle",
    "Scete",
    "Egypt",
    "Desert Fathers",
    "Infant Jesus",
    "Real Presence",
    "Early Church",
    "Monasticism"
  ]
}
]