[
  {
    "id": 1,
    "dayOfYear": 1,
    "title": "The First Promise of a Savior",
    "category": "Messianic Prophecy",
    "otBook": "Genesis",
    "otReference": "Genesis 3:15",
    "otText": "I will put enmity between you and the woman, and between your offspring and hers; he will crush your head, and you will strike his heel.",
    "historicalContext": "Immediately after Adam and Eve's sin, God spoke these words to the serpent. This is humanity's first glimpse of hope after the Fall.",
    "howItPointsToJesus": "This is called the 'Protoevangelium' - the first gospel. God promises that a descendant of the woman (born of Mary) will crush Satan's head, though the serpent will strike his heel. The cross is where Jesus crushed Satan's power, though he suffered (heel struck) in the process.",
    "keyInsights": [
      "First prophecy in the Bible points to Jesus",
      "Born of a woman (virgin birth)",
      "Victory through suffering",
      "Satan defeated at the cross"
    ]
  },
  {
    "id": 2,
    "dayOfYear": 2,
    "title": "Abraham's Son of Promise",
    "category": "Type of Christ",
    "otBook": "Genesis",
    "otReference": "Genesis 22:1-14",
    "otText": "Take your son, your only son, whom you love—Isaac—and go to the region of Moriah. Sacrifice him there as a burnt offering.",
    "historicalContext": "God tested Abraham's faith by asking him to sacrifice his beloved son Isaac, the son of promise, on Mount Moriah.",
    "howItPointsToJesus": "Every detail foreshadows Jesus: Abraham is like God the Father offering his only beloved son. Isaac carries the wood (Jesus carried the cross) up the mountain. Isaac asks 'where is the lamb?' and Abraham says 'God will provide' - prophesying that God would provide His own Son as the sacrifice. Mount Moriah is where Jerusalem and the Temple were later built - where Jesus was sacrificed.",
    "keyInsights": [
      "Only beloved son offered in sacrifice",
      "Son carries the wood of sacrifice",
      "God provides the lamb (Jesus)",
      "Same location as Jesus' crucifixion"
    ]
  },
  {
    "id": 3,
    "dayOfYear": 3,
    "title": "Jacob's Ladder to Heaven",
    "category": "Symbol",
    "otBook": "Genesis",
    "otReference": "Genesis 28:12",
    "otText": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it.",
    "historicalContext": "Jacob, fleeing from his brother Esau, slept in the wilderness and dreamed of a ladder connecting heaven and earth.",
    "howItPointsToJesus": "Jesus himself explained this in John 1:51 when he said 'you will see heaven open, and the angels of God ascending and descending on the Son of Man.' Jesus IS the ladder - the bridge between heaven and earth. Through his incarnation, he connects God and humanity. He is the only way to the Father.",
    "keyInsights": [
      "Jesus is the bridge between God and man",
      "Heaven and earth connected through Christ",
      "The only way to reach God",
      "Angels serve the Messiah"
    ]
  },
  {
    "id": 4,
    "dayOfYear": 4,
    "title": "Joseph: Beloved Son Betrayed",
    "category": "Type of Christ",
    "otBook": "Genesis",
    "otReference": "Genesis 37:3-28",
    "otText": "Now Israel loved Joseph more than any of his other sons... When his brothers saw that their father loved him more than any of them, they hated him.",
    "historicalContext": "Joseph was Jacob's beloved son, given a special robe. His brothers grew jealous and sold him into slavery for twenty pieces of silver.",
    "howItPointsToJesus": "Joseph's life remarkably mirrors Jesus: beloved son of his father, hated by his brothers (Jews rejected Jesus), betrayed for silver (Jesus for 30 pieces), stripped of his robe, thrown into a pit (death), then raised to the highest position in Egypt to save the world from famine. He forgave his brothers and revealed himself to them (Second Coming).",
    "keyInsights": [
      "Beloved son rejected by brothers",
      "Sold for silver",
      "Descended into death, raised to power",
      "Saved the world through suffering"
    ]
  },
  {
    "id": 5,
    "dayOfYear": 5,
    "title": "The Passover Lamb",
    "category": "Symbol",
    "otBook": "Exodus",
    "otReference": "Exodus 12:5-7",
    "otText": "The animals you choose must be year-old males without defect... Take some of the blood and put it on the sides and tops of the doorframes. The blood will be a sign for you.",
    "historicalContext": "God commanded Israel to sacrifice an unblemished lamb and mark their doorposts with blood so the angel of death would pass over their homes.",
    "howItPointsToJesus": "Jesus is called 'the Lamb of God' because every detail of the Passover points to him: unblemished (sinless), male in prime of life, bones unbroken, blood brings salvation, slain at twilight (Jesus died at 3pm). The sacrifice wasn't just historical - it was prophetic rehearsal for what Jesus would do 1,500 years later.",
    "keyInsights": [
      "Unblemished = Jesus without sin",
      "Blood saves from death",
      "Bones unbroken (fulfilled at cross)",
      "One sacrifice saves the household"
    ]
  },
  {
    "id": 6,
    "dayOfYear": 6,
    "title": "The Bronze Serpent",
    "category": "Prefigurement",
    "otBook": "Numbers",
    "otReference": "Numbers 21:8-9",
    "otText": "Make a snake and put it up on a pole; anyone who is bitten can look at it and live.",
    "historicalContext": "When poisonous serpents attacked Israel in the wilderness, God told Moses to lift up a bronze serpent on a pole. Anyone who looked at it would be healed.",
    "howItPointsToJesus": "Jesus himself explained this in John 3:14 - 'Just as Moses lifted up the snake in the wilderness, so the Son of Man must be lifted up.' Jesus, who knew no sin, became sin for us on the cross. Just as Israelites looked to the bronze serpent and lived, we look to Jesus crucified and receive eternal life. The poison of sin is healed by looking in faith to the cross.",
    "keyInsights": [
      "Lifted up on a pole = crucifixion",
      "Looking in faith brings healing",
      "Serpent represents sin taken on by Christ",
      "Simple faith in God's provision saves"
    ]
  },
  {
    "id": 7,
    "dayOfYear": 7,
    "title": "The Scapegoat",
    "category": "Prefigurement",
    "otBook": "Leviticus",
    "otReference": "Leviticus 16:21-22",
    "otText": "He is to lay both hands on the head of the live goat and confess over it all the wickedness and rebellion of the Israelites. The goat will carry on itself all their sins to a remote place.",
    "historicalContext": "On the Day of Atonement, the high priest would confess Israel's sins over a goat, then send it into the wilderness, symbolically carrying away their sins.",
    "howItPointsToJesus": "Jesus is our scapegoat who carried our sins away. Isaiah 53:6 says 'the LORD has laid on him the iniquity of us all.' Just as the goat bore sins it didn't commit, Jesus - who was sinless - bore our sins on the cross and carried them away forever. Our sins are removed 'as far as the east is from the west.'",
    "keyInsights": [
      "Jesus carries sins he didn't commit",
      "Our guilt transferred to him",
      "Sins removed completely",
      "Day of Atonement fulfilled at the cross"
    ]
  },
  {
    "id": 8,
    "dayOfYear": 8,
    "title": "The Suffering Servant",
    "category": "Messianic Prophecy",
    "otBook": "Isaiah",
    "otReference": "Isaiah 53:5",
    "otText": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
    "historicalContext": "Written 700 years before Christ, Isaiah described a coming servant who would suffer for the sins of others - a completely foreign concept in ancient Judaism.",
    "howItPointsToJesus": "This chapter reads like an eyewitness account of the crucifixion, yet was written centuries before crucifixion was invented. It describes: piercing (nails and spear), suffering for others' sins, silence before accusers, burial with the rich, making himself a guilt offering. Every detail was fulfilled in Jesus.",
    "keyInsights": [
      "Written 700 years before crucifixion existed",
      "Describes voluntary suffering for others",
      "Pierced, crushed, wounded = crucifixion details",
      "Healing comes through his suffering"
    ]
  },
  {
    "id": 9,
    "dayOfYear": 9,
    "title": "Born of a Virgin in Bethlehem",
    "category": "Messianic Prophecy",
    "otBook": "Isaiah",
    "otReference": "Isaiah 7:14",
    "otText": "Therefore the Lord himself will give you a sign: The virgin will conceive and give birth to a son, and will call him Immanuel.",
    "historicalContext": "King Ahaz faced enemies threatening Jerusalem. Isaiah gave him this sign - a virgin would conceive and bear a son called 'God with us.'",
    "howItPointsToJesus": "This prophecy, given 700 years before Christ, declared an impossible miracle: a virgin would conceive. The child would be called 'Immanuel' - God with us. Matthew quotes this when describing Jesus' virgin birth to Mary. Jesus is literally God dwelling with humanity - the ultimate fulfillment of Immanuel.",
    "keyInsights": [
      "Virgin birth prophesied 700 years early",
      "Name means 'God with us'",
      "Miraculous sign from God himself",
      "Jesus is God incarnate"
    ]
  },
  {
    "id": 10,
    "dayOfYear": 10,
    "title": "Wonderful Counselor, Mighty God",
    "category": "Messianic Prophecy",
    "otBook": "Isaiah",
    "otReference": "Isaiah 9:6",
    "otText": "For to us a child is born, to us a son is given, and the government will be on his shoulders. And he will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.",
    "historicalContext": "Isaiah prophesied during dark times of war and judgment, yet proclaimed that a child would be born who would reign forever in peace and justice.",
    "howItPointsToJesus": "This child born is called 'Mighty God' and 'Everlasting Father' - divine titles. Yet he is also human - 'a child is born.' This is the mystery of the incarnation: fully God and fully man. The government on his shoulders speaks of his eternal kingdom. Jesus is the only one who fits all these divine and human titles.",
    "keyInsights": [
      "Child is called 'Mighty God' - divine nature",
      "Born as human, yet eternal God",
      "Prince of Peace - brings reconciliation",
      "Eternal kingdom without end"
    ]
  }
]
