[
  {
    "id": 1,
    "dayOfYear": 1,
    "title": "The First Promise of a Savior",
    "category": "Messianic Prophecy",
    "otBook": "Genesis",
    "otReference": "Genesis 3:15",
    "otText": "I will put enmity between you and the woman, and between your offspring and hers; he will crush your head, and you will strike his heel.",
    "historicalContext": "Immediately after Adam and Eve's sin, God spoke these words to the serpent. This is humanity's first glimpse of hope after the Fall.",
    "howItPointsToJesus": "This is called the 'Protoevangelium' - the first gospel. God promises that a descendant of the woman (born of Mary) will crush Satan's head, though the serpent will strike his heel. The cross is where Jesus crushed Satan's power, though he suffered (heel struck) in the process.",
    "keyInsights": [
      "First prophecy in the Bible points to Jesus",
      "Born of a woman (virgin birth)",
      "Victory through suffering",
      "Satan defeated at the cross"
    ]
  },
  {
    "id": 2,
    "dayOfYear": 2,
    "title": "Abraham's Son of Promise",
    "category": "Type of Christ",
    "otBook": "Genesis",
    "otReference": "Genesis 22:1-14",
    "otText": "Take your son, your only son, whom you love—Isaac—and go to the region of Moriah. Sacrifice him there as a burnt offering.",
    "historicalContext": "God tested Abraham's faith by asking him to sacrifice his beloved son Isaac, the son of promise, on Mount Moriah.",
    "howItPointsToJesus": "Every detail foreshadows Jesus: Abraham is like God the Father offering his only beloved son. Isaac carries the wood (Jesus carried the cross) up the mountain. Isaac asks 'where is the lamb?' and Abraham says 'God will provide' - prophesying that God would provide His own Son as the sacrifice. Mount Moriah is where Jerusalem and the Temple were later built - where Jesus was sacrificed.",
    "keyInsights": [
      "Only beloved son offered in sacrifice",
      "Son carries the wood of sacrifice",
      "God provides the lamb (Jesus)",
      "Same location as Jesus' crucifixion"
    ]
  },
  {
    "id": 3,
    "dayOfYear": 3,
    "title": "Jacob's Ladder to Heaven",
    "category": "Symbol",
    "otBook": "Genesis",
    "otReference": "Genesis 28:12",
    "otText": "He had a dream in which he saw a stairway resting on the earth, with its top reaching to heaven, and the angels of God were ascending and descending on it.",
    "historicalContext": "Jacob, fleeing from his brother Esau, slept in the wilderness and dreamed of a ladder connecting heaven and earth.",
    "howItPointsToJesus": "Jesus himself explained this in John 1:51 when he said 'you will see heaven open, and the angels of God ascending and descending on the Son of Man.' Jesus IS the ladder - the bridge between heaven and earth. Through his incarnation, he connects God and humanity. He is the only way to the Father.",
    "keyInsights": [
      "Jesus is the bridge between God and man",
      "Heaven and earth connected through Christ",
      "The only way to reach God",
      "Angels serve the Messiah"
    ]
  },
  {
    "id": 4,
    "dayOfYear": 4,
    "title": "Joseph: Beloved Son Betrayed",
    "category": "Type of Christ",
    "otBook": "Genesis",
    "otReference": "Genesis 37:3-28",
    "otText": "Now Israel loved Joseph more than any of his other sons... When his brothers saw that their father loved him more than any of them, they hated him.",
    "historicalContext": "Joseph was Jacob's beloved son, given a special robe. His brothers grew jealous and sold him into slavery for twenty pieces of silver.",
    "howItPointsToJesus": "Joseph's life remarkably mirrors Jesus: beloved son of his father, hated by his brothers (Jews rejected Jesus), betrayed for silver (Jesus for 30 pieces), stripped of his robe, thrown into a pit (death), then raised to the highest position in Egypt to save the world from famine. He forgave his brothers and revealed himself to them (Second Coming).",
    "keyInsights": [
      "Beloved son rejected by brothers",
      "Sold for silver",
      "Descended into death, raised to power",
      "Saved the world through suffering"
    ]
  },
  {
    "id": 5,
    "dayOfYear": 5,
    "title": "The Passover Lamb",
    "category": "Symbol",
    "otBook": "Exodus",
    "otReference": "Exodus 12:5-7",
    "otText": "The animals you choose must be year-old males without defect... Take some of the blood and put it on the sides and tops of the doorframes. The blood will be a sign for you.",
    "historicalContext": "God commanded Israel to sacrifice an unblemished lamb and mark their doorposts with blood so the angel of death would pass over their homes.",
    "howItPointsToJesus": "Jesus is called 'the Lamb of God' because every detail of the Passover points to him: unblemished (sinless), male in prime of life, bones unbroken, blood brings salvation, slain at twilight (Jesus died at 3pm). The sacrifice wasn't just historical - it was prophetic rehearsal for what Jesus would do 1,500 years later.",
    "keyInsights": [
      "Unblemished = Jesus without sin",
      "Blood saves from death",
      "Bones unbroken (fulfilled at cross)",
      "One sacrifice saves the household"
    ]
  },
  {
    "id": 6,
    "dayOfYear": 6,
    "title": "The Bronze Serpent",
    "category": "Prefigurement",
    "otBook": "Numbers",
    "otReference": "Numbers 21:8-9",
    "otText": "Make a snake and put it up on a pole; anyone who is bitten can look at it and live.",
    "historicalContext": "When poisonous serpents attacked Israel in the wilderness, God told Moses to lift up a bronze serpent on a pole. Anyone who looked at it would be healed.",
    "howItPointsToJesus": "Jesus himself explained this in John 3:14 - 'Just as Moses lifted up the snake in the wilderness, so the Son of Man must be lifted up.' Jesus, who knew no sin, became sin for us on the cross. Just as Israelites looked to the bronze serpent and lived, we look to Jesus crucified and receive eternal life. The poison of sin is healed by looking in faith to the cross.",
    "keyInsights": [
      "Lifted up on a pole = crucifixion",
      "Looking in faith brings healing",
      "Serpent represents sin taken on by Christ",
      "Simple faith in God's provision saves"
    ]
  },
  {
    "id": 7,
    "dayOfYear": 7,
    "title": "The Scapegoat",
    "category": "Prefigurement",
    "otBook": "Leviticus",
    "otReference": "Leviticus 16:21-22",
    "otText": "He is to lay both hands on the head of the live goat and confess over it all the wickedness and rebellion of the Israelites. The goat will carry on itself all their sins to a remote place.",
    "historicalContext": "On the Day of Atonement, the high priest would confess Israel's sins over a goat, then send it into the wilderness, symbolically carrying away their sins.",
    "howItPointsToJesus": "Jesus is our scapegoat who carried our sins away. Isaiah 53:6 says 'the LORD has laid on him the iniquity of us all.' Just as the goat bore sins it didn't commit, Jesus - who was sinless - bore our sins on the cross and carried them away forever. Our sins are removed 'as far as the east is from the west.'",
    "keyInsights": [
      "Jesus carries sins he didn't commit",
      "Our guilt transferred to him",
      "Sins removed completely",
      "Day of Atonement fulfilled at the cross"
    ]
  },
  {
    "id": 8,
    "dayOfYear": 8,
    "title": "The Suffering Servant",
    "category": "Messianic Prophecy",
    "otBook": "Isaiah",
    "otReference": "Isaiah 53:5",
    "otText": "But he was pierced for our transgressions, he was crushed for our iniquities; the punishment that brought us peace was on him, and by his wounds we are healed.",
    "historicalContext": "Written 700 years before Christ, Isaiah described a coming servant who would suffer for the sins of others - a completely foreign concept in ancient Judaism.",
    "howItPointsToJesus": "This chapter reads like an eyewitness account of the crucifixion, yet was written centuries before crucifixion was invented. It describes: piercing (nails and spear), suffering for others' sins, silence before accusers, burial with the rich, making himself a guilt offering. Every detail was fulfilled in Jesus.",
    "keyInsights": [
      "Written 700 years before crucifixion existed",
      "Describes voluntary suffering for others",
      "Pierced, crushed, wounded = crucifixion details",
      "Healing comes through his suffering"
    ]
  },
  {
    "id": 9,
    "dayOfYear": 9,
    "title": "Born of a Virgin in Bethlehem",
    "category": "Messianic Prophecy",
    "otBook": "Isaiah",
    "otReference": "Isaiah 7:14",
    "otText": "Therefore the Lord himself will give you a sign: The virgin will conceive and give birth to a son, and will call him Immanuel.",
    "historicalContext": "King Ahaz faced enemies threatening Jerusalem. Isaiah gave him this sign - a virgin would conceive and bear a son called 'God with us.'",
    "howItPointsToJesus": "This prophecy, given 700 years before Christ, declared an impossible miracle: a virgin would conceive. The child would be called 'Immanuel' - God with us. Matthew quotes this when describing Jesus' virgin birth to Mary. Jesus is literally God dwelling with humanity - the ultimate fulfillment of Immanuel.",
    "keyInsights": [
      "Virgin birth prophesied 700 years early",
      "Name means 'God with us'",
      "Miraculous sign from God himself",
      "Jesus is God incarnate"
    ]
  },
  {
    "id": 10,
    "dayOfYear": 10,
    "title": "Wonderful Counselor, Mighty God",
    "category": "Messianic Prophecy",
    "otBook": "Isaiah",
    "otReference": "Isaiah 9:6",
    "otText": "For to us a child is born, to us a son is given, and the government will be on his shoulders. And he will be called Wonderful Counselor, Mighty God, Everlasting Father, Prince of Peace.",
    "historicalContext": "Isaiah prophesied during dark times of war and judgment, yet proclaimed that a child would be born who would reign forever in peace and justice.",
    "howItPointsToJesus": "This child born is called 'Mighty God' and 'Everlasting Father' - divine titles. Yet he is also human - 'a child is born.' This is the mystery of the incarnation: fully God and fully man. The government on his shoulders speaks of his eternal kingdom. Jesus is the only one who fits all these divine and human titles.",
    "keyInsights": [
      "Child is called 'Mighty God' - divine nature",
      "Born as human, yet eternal God",
      "Prince of Peace - brings reconciliation",
      "Eternal kingdom without end"
    ]
  },
  {
    "id": 11,
    "dayOfYear": 11,
    "title": "Moses the Deliverer",
    "category": "Type of Christ",
    "otBook": "Exodus",
    "otReference": "Exodus 2:1-10, 3:7-10",
    "otText": "I have indeed seen the misery of my people in Egypt... So I have come down to rescue them.",
    "historicalContext": "Moses was born under a death sentence (Pharaoh ordered all Hebrew boys killed), yet saved through water in a basket. He later delivered Israel from slavery.",
    "howItPointsToJesus": "Moses foreshadows Jesus: born under death sentence (Herod's massacre), saved through providence, became the deliverer of God's people. Moses delivered from physical slavery in Egypt; Jesus delivers from spiritual slavery to sin. Moses gave the Law; Jesus fulfilled it. Moses led through the Red Sea; Jesus leads through baptism.",
    "keyInsights": [
      "Born under death threat, divinely protected",
      "Mediator between God and people",
      "Deliverer from bondage",
      "Prophet, priest, and leader"
    ]
  },
  {
    "id": 12,
    "dayOfYear": 12,
    "title": "The Manna from Heaven",
    "category": "Symbol",
    "otBook": "Exodus",
    "otReference": "Exodus 16:4",
    "otText": "I will rain down bread from heaven for you. The people are to go out each day and gather enough for that day.",
    "historicalContext": "When Israel hungered in the wilderness, God provided bread from heaven daily to sustain them for 40 years.",
    "howItPointsToJesus": "Jesus declared 'I am the bread of life' and said the manna was a sign pointing to him. Physical manna sustained physical life temporarily; Jesus sustains spiritual life eternally. Manna came from heaven; Jesus came from heaven. Manna was white and pure; Jesus is sinless. In the Eucharist, Jesus gives us himself as the true bread from heaven.",
    "keyInsights": [
      "Bread from heaven = Jesus descended from heaven",
      "Daily provision = daily need for Christ",
      "Sustained life in wilderness = Jesus sustains us",
      "Points to the Eucharist"
    ]
  },
  {
    "id": 13,
    "dayOfYear": 13,
    "title": "The Rock That Provides Water",
    "category": "Symbol",
    "otBook": "Exodus",
    "otReference": "Exodus 17:6",
    "otText": "I will stand there before you by the rock at Horeb. Strike the rock, and water will come out of it for the people to drink.",
    "historicalContext": "When Israel thirsted in the desert, God commanded Moses to strike a rock, and water gushed out to sustain them.",
    "howItPointsToJesus": "Paul writes 'they drank from the spiritual rock that accompanied them, and that rock was Christ.' The rock represents Jesus - struck (crucified), from whom flows living water (the Holy Spirit). When the soldier pierced Jesus' side, blood and water flowed out. Jesus is the rock struck for us, providing eternal life-giving water.",
    "keyInsights": [
      "Rock struck = Jesus crucified",
      "Water flows from the rock = Holy Spirit from Christ",
      "Provides life in the wilderness",
      "Once struck, provides forever"
    ]
  },
  {
    "id": 14,
    "dayOfYear": 14,
    "title": "The High Priest Who Intercedes",
    "category": "Prefigurement",
    "otBook": "Leviticus",
    "otReference": "Leviticus 16:32-34",
    "otText": "The priest who is anointed and ordained to succeed his father as high priest is to make atonement... because on this day atonement will be made for you, to cleanse you.",
    "historicalContext": "The high priest entered the Holy of Holies once a year on the Day of Atonement to make sacrifice for the sins of all Israel.",
    "howItPointsToJesus": "Jesus is our eternal high priest. The earthly high priest entered the Holy of Holies yearly with animal blood; Jesus entered the heavenly Holy of Holies once for all with his own blood. The earthly priest had to sacrifice for his own sins first; Jesus was sinless. The earthly priesthood ended at death; Jesus' priesthood is eternal.",
    "keyInsights": [
      "Jesus is our eternal high priest",
      "Entered heaven itself, not earthly temple",
      "His own blood, not animals'",
      "One sacrifice forever, not yearly"
    ]
  },
  {
    "id": 15,
    "dayOfYear": 15,
    "title": "David the Shepherd King",
    "category": "Type of Christ",
    "otBook": "1 Samuel",
    "otReference": "1 Samuel 17:34-37",
    "otText": "Your servant has been keeping his father's sheep. When a lion or a bear came and carried off a sheep from the flock, I went after it, struck it and rescued the sheep from its mouth.",
    "historicalContext": "David, the youngest son, was a shepherd before being anointed king. He defeated Goliath and became Israel's greatest king.",
    "howItPointsToJesus": "Jesus is called both 'Son of David' and 'Good Shepherd.' Like David, Jesus was rejected by his brothers, anointed by God, defeated the giant (Satan), and became King. David killed the lion and bear to protect his sheep; Jesus defeated sin and death to save us. David's kingdom was earthly and temporary; Jesus' kingdom is eternal.",
    "keyInsights": [
      "Shepherd who becomes king",
      "Defeats giants/enemies for his people",
      "Anointed one (Messiah/Christ)",
      "King from line of David"
    ]
  },
  {
    "id": 16,
    "dayOfYear": 16,
    "title": "Jonah: Three Days in the Grave",
    "category": "Type of Christ",
    "otBook": "Jonah",
    "otReference": "Jonah 1:17; 2:10",
    "otText": "The LORD provided a huge fish to swallow Jonah, and Jonah was in the belly of the fish three days and three nights... And the LORD commanded the fish, and it vomited Jonah onto dry land.",
    "historicalContext": "Jonah, fleeing from God's call, was swallowed by a great fish for three days before being spit out alive to fulfill his mission.",
    "howItPointsToJesus": "Jesus said 'As Jonah was three days and three nights in the belly of the huge fish, so the Son of Man will be three days and three nights in the heart of the earth.' Jonah's time in the fish represents Jesus' time in the tomb. Jonah brought salvation to Gentiles (Nineveh); Jesus brings salvation to all nations. Both brought God's message after being 'raised' from death.",
    "keyInsights": [
      "Three days in darkness = Jesus in tomb",
      "Raised to life on third day",
      "Brought salvation to Gentiles",
      "Jesus himself cited this sign"
    ]
  },
  {
    "id": 17,
    "dayOfYear": 17,
    "title": "Psalm 22: The Crucifixion Psalm",
    "category": "Messianic Prophecy",
    "otBook": "Psalms",
    "otReference": "Psalm 22:1, 16-18",
    "otText": "My God, my God, why have you forsaken me?... They pierce my hands and my feet. All my bones are on display; people stare and gloat over me. They divide my clothes among them and cast lots for my garment.",
    "historicalContext": "Written by David 1,000 years before Christ, describing anguish and suffering in vivid detail.",
    "howItPointsToJesus": "This psalm reads like an eyewitness account of the crucifixion: Jesus cried 'My God, my God, why have you forsaken me?' (the opening line). It describes pierced hands and feet (crucifixion before it existed), bones on display, people mocking, soldiers gambling for clothes - every detail fulfilled at Calvary. David never experienced this; he was prophesying the Messiah's death.",
    "keyInsights": [
      "Jesus' exact words from the cross",
      "Piercing before crucifixion invented",
      "Soldiers gambling for clothes fulfilled",
      "Written 1,000 years before Christ"
    ]
  },
  {
    "id": 18,
    "dayOfYear": 18,
    "title": "Born in Bethlehem",
    "category": "Messianic Prophecy",
    "otBook": "Micah",
    "otReference": "Micah 5:2",
    "otText": "But you, Bethlehem Ephrathah, though you are small among the clans of Judah, out of you will come for me one who will be ruler over Israel, whose origins are from of old, from ancient times.",
    "historicalContext": "Micah, writing 700 years before Christ, pinpointed the exact birthplace of the Messiah - the small town of Bethlehem.",
    "howItPointsToJesus": "This prophecy is remarkably specific: not just any town, but Bethlehem Ephrathah (to distinguish from another Bethlehem). The ruler's 'origins are from of old, from ancient times' - indicating pre-existence and divinity. When magi asked where the Messiah would be born, scribes quoted this verse. Jesus was born in Bethlehem exactly as prophesied.",
    "keyInsights": [
      "Specific birthplace prophesied 700 years early",
      "Small town - humble beginnings",
      "Ruler with eternal origins",
      "Recognized by Jewish scholars as messianic"
    ]
  },
  {
    "id": 19,
    "dayOfYear": 19,
    "title": "Zechariah: Pierced for Us",
    "category": "Messianic Prophecy",
    "otBook": "Zechariah",
    "otReference": "Zechariah 12:10",
    "otText": "They will look on me, the one they have pierced, and they will mourn for him as one mourns for an only child, and grieve bitterly for him as one grieves for a firstborn son.",
    "historicalContext": "Zechariah prophesied about 500 years before Christ, describing a future time when Israel would look upon the pierced one and mourn.",
    "howItPointsToJesus": "This prophecy is striking because God says 'they will look on ME, the one they have pierced' - identifying the pierced one as God himself. This was fulfilled when Jesus was pierced by the spear on the cross. The mourning describes both the disciples' grief and a future recognition by Israel. Jesus is the pierced God who came to save us.",
    "keyInsights": [
      "God himself will be pierced",
      "Prophesied 500 years before crucifixion",
      "Mourning for the only son",
      "Future recognition by Israel"
    ]
  },
  {
    "id": 20,
    "dayOfYear": 20,
    "title": "Melchizedek: Priest Forever",
    "category": "Type of Christ",
    "otBook": "Genesis",
    "otReference": "Genesis 14:18-20",
    "otText": "Then Melchizedek king of Salem brought out bread and wine. He was priest of God Most High, and he blessed Abram.",
    "historicalContext": "Melchizedek appears mysteriously in Genesis as both king and priest, blessing Abraham. He is never mentioned having parents, birth, or death in Scripture.",
    "howItPointsToJesus": "Psalm 110 prophesies the Messiah will be 'a priest forever in the order of Melchizedek.' Like Melchizedek, Jesus is both king and priest - roles that were separated in Israel. Melchizedek offered bread and wine, foreshadowing the Eucharist. His mysterious appearance without genealogy represents Christ's eternal priesthood - no beginning, no end.",
    "keyInsights": [
      "King and priest (Jesus alone combines both)",
      "Offered bread and wine (Eucharist)",
      "Eternal priesthood (no beginning or end)",
      "Greater than Abraham (blessed him)"
    ]
  },
  {
    "id": 21,
    "dayOfYear": 21,
    "title": "The Tabernacle: God Dwelling With Us",
    "category": "Symbol",
    "otBook": "Exodus",
    "otReference": "Exodus 25:8-9",
    "otText": "Then have them make a sanctuary for me, and I will dwell among them. Make this tabernacle and all its furnishings exactly like the pattern I will show you.",
    "historicalContext": "God commanded Moses to build a portable sanctuary where His presence would dwell among Israel during their wilderness journey.",
    "howItPointsToJesus": "The entire tabernacle is a picture of Jesus. John 1:14 says 'The Word became flesh and tabernacled among us.' Just as God's presence dwelled in the tabernacle, Jesus is God dwelling with humanity. The outer court, Holy Place, and Holy of Holies represent the journey to God through Christ. Every item - altar, lampstand, bread - points to Jesus.",
    "keyInsights": [
      "God dwelling with humanity = Incarnation",
      "One entrance = Jesus the only way",
      "Altar = Jesus' sacrifice",
      "Bread and lampstand = Jesus is bread and light"
    ]
  },
  {
    "id": 22,
    "dayOfYear": 22,
    "title": "The Ark of the Covenant",
    "category": "Symbol",
    "otBook": "Exodus",
    "otReference": "Exodus 25:10-22",
    "otText": "Have them make an ark... Overlay it with pure gold... Place in the ark the tablets of the covenant law... There, above the cover between the two cherubim... I will meet with you.",
    "historicalContext": "The Ark was the most sacred object in Israel, containing the tablets of the Law, representing God's presence and covenant with His people.",
    "howItPointsToJesus": "The Ark contained the Law; Jesus fulfilled the Law perfectly. The Ark was made of wood (humanity) covered in gold (divinity) - like Jesus, fully human and divine. The mercy seat on top, where blood was sprinkled, represents Jesus' atonement. Catholic tradition sees Mary as the new Ark - she carried Jesus, the new covenant, in her womb.",
    "keyInsights": [
      "Wood and gold = human and divine nature",
      "Contained the Law = Jesus fulfilled Law",
      "Mercy seat = place of atonement",
      "Mary as new Ark carrying Jesus"
    ]
  },
  {
    "id": 23,
    "dayOfYear": 23,
    "title": "Daniel's Son of Man",
    "category": "Messianic Prophecy",
    "otBook": "Daniel",
    "otReference": "Daniel 7:13-14",
    "otText": "In my vision at night I looked, and there before me was one like a son of man, coming with the clouds of heaven... He was given authority, glory and sovereign power; all nations and peoples of every language worshiped him.",
    "historicalContext": "Daniel, in exile in Babylon, received visions of future kingdoms and the coming of God's eternal kingdom.",
    "howItPointsToJesus": "'Son of Man' was Jesus' favorite self-designation. This vision shows the Son of Man receiving worship and eternal dominion - attributes belonging only to God. Jesus is both 'Son of Man' (emphasizing his humanity) and worthy of worship (his divinity). He will return on clouds, just as Daniel saw, to establish his eternal kingdom.",
    "keyInsights": [
      "Son of Man receives worship (deity)",
      "Given eternal dominion",
      "All nations will serve him",
      "Coming on clouds (Second Coming)"
    ]
  },
  {
    "id": 24,
    "dayOfYear": 24,
    "title": "The Kinsman Redeemer",
    "category": "Type of Christ",
    "otBook": "Ruth",
    "otReference": "Ruth 3:9; 4:9-10",
    "otText": "I am Ruth your servant. Spread the corner of your garment over me, since you are a guardian-redeemer of our family.",
    "historicalContext": "Boaz, a wealthy relative, redeemed Ruth the Moabite widow by buying back her deceased husband's property and marrying her, giving her security and a future.",
    "howItPointsToJesus": "Boaz is a beautiful picture of Jesus our Redeemer. Like Boaz, Jesus is our kinsman (became human to be our relative), our redeemer (paid the price to buy us back from sin), and our bridegroom (the Church is his bride). Boaz redeemed Ruth, a Gentile, showing that Jesus' salvation extends to all nations, not just Jews.",
    "keyInsights": [
      "Kinsman Redeemer = Jesus became human",
      "Paid the price to redeem us",
      "Married the bride (Church)",
      "Gentile included (salvation for all)"
    ]
  },
  {
    "id": 25,
    "dayOfYear": 25,
    "title": "The Righteous Branch",
    "category": "Messianic Prophecy",
    "otBook": "Jeremiah",
    "otReference": "Jeremiah 23:5-6",
    "otText": "The days are coming, declares the LORD, when I will raise up for David a righteous Branch, a King who will reign wisely and do what is just and right in the land... This is the name by which he will be called: The LORD Our Righteous Savior.",
    "historicalContext": "Jeremiah prophesied during Israel's darkest days before exile, yet promised a future righteous king from David's line.",
    "howItPointsToJesus": "This 'Branch' from David's line is called 'The LORD' - identifying the Messiah as God himself. Jesus is both the descendant of David (human) and 'LORD' (divine). The name means 'YHWH is our righteousness' - we are made righteous through Christ. He is the wise king who reigns with perfect justice.",
    "keyInsights": [
      "From David's line yet called LORD",
      "God and man united",
      "Brings righteousness to his people",
      "Wise and just King"
    ]
  },
  {
    "id": 26,
    "dayOfYear": 26,
    "title": "Ezekiel's Good Shepherd",
    "category": "Messianic Prophecy",
    "otBook": "Ezekiel",
    "otReference": "Ezekiel 34:11-12, 23",
    "otText": "For this is what the Sovereign LORD says: I myself will search for my sheep and look after them... I will place over them one shepherd, my servant David, and he will tend them.",
    "historicalContext": "Ezekiel prophesied to Israel in exile, condemning the bad shepherds (leaders) who abandoned the flock and promising God would shepherd them himself.",
    "howItPointsToJesus": "God says 'I MYSELF will shepherd my flock' yet also says he will raise up 'my servant David' to shepherd - revealing that the Messiah would be both God and man. Jesus declared 'I am the good shepherd' - fulfilling this prophecy. He is both David's descendant and the LORD who searches for lost sheep.",
    "keyInsights": [
      "God himself shepherds = Jesus is God",
      "Yet from David's line = Jesus is man",
      "Seeks the lost sheep",
      "Lays down life for sheep"
    ]
  },
  {
    "id": 27,
    "dayOfYear": 27,
    "title": "Hosea: Love That Redeems",
    "category": "Type of Christ",
    "otBook": "Hosea",
    "otReference": "Hosea 3:1-2",
    "otText": "The LORD said to me, 'Go, show your love to your wife again, though she is loved by another and is an adulteress. Love her as the LORD loves the Israelites.' So I bought her for fifteen shekels of silver.",
    "historicalContext": "God commanded Hosea to marry an unfaithful woman as a living illustration of God's faithful love for adulterous Israel who worshiped idols.",
    "howItPointsToJesus": "Hosea's marriage mirrors Christ's love for the Church. Just as Hosea loved and redeemed his unfaithful wife, Jesus loves and redeems us despite our unfaithfulness. Hosea paid a price to buy back his wife; Jesus paid with his blood to redeem us. This shows that God's love pursues us even when we are unfaithful.",
    "keyInsights": [
      "Faithful love for unfaithful people",
      "Paid price to redeem bride",
      "God's pursuing love",
      "Church as Christ's bride"
    ]
  },
  {
    "id": 28,
    "dayOfYear": 28,
    "title": "Joel: The Spirit Poured Out",
    "category": "Messianic Prophecy",
    "otBook": "Joel",
    "otReference": "Joel 2:28-29",
    "otText": "And afterward, I will pour out my Spirit on all people. Your sons and daughters will prophesy, your old men will dream dreams, your young men will see visions. Even on my servants, both men and women, I will pour out my Spirit in those days.",
    "historicalContext": "Joel prophesied about a future day when God's Spirit would be poured out on all flesh, not just prophets and kings.",
    "howItPointsToJesus": "Peter quoted this prophecy on Pentecost when the Holy Spirit was poured out on the Church. Jesus promised he would send the Spirit after his ascension. This marks the age of the New Covenant inaugurated by Christ - where God's Spirit dwells in all believers, not just a select few. The Spirit comes because Jesus accomplished redemption.",
    "keyInsights": [
      "Spirit for all people (not just Israel)",
      "Both men and women receive Spirit",
      "Fulfilled at Pentecost",
      "New Covenant age through Christ"
    ]
  },
  {
    "id": 29,
    "dayOfYear": 29,
    "title": "Malachi: Sun of Righteousness",
    "category": "Messianic Prophecy",
    "otBook": "Malachi",
    "otReference": "Malachi 4:2",
    "otText": "But for you who revere my name, the sun of righteousness will rise with healing in its rays. And you will go out and frolic like well-fed calves.",
    "historicalContext": "Malachi, the last Old Testament prophet, prophesied about the coming Messiah after 400 years of silence would end.",
    "howItPointsToJesus": "Jesus is the 'Sun of Righteousness' who brings light to those in darkness. He brings healing - physical, spiritual, and emotional. Just as the sun rises after darkness, Jesus came after 400 years of prophetic silence. He is the light of the world, dispelling darkness. His coming brings joy (frolicking like calves) and healing to all who receive him.",
    "keyInsights": [
      "Brings light after darkness",
      "Healing in his presence",
      "Ends 400 years of silence",
      "Joy and freedom for believers"
    ]
  },
  {
    "id": 30,
    "dayOfYear": 30,
    "title": "The New Covenant Written on Hearts",
    "category": "Messianic Prophecy",
    "otBook": "Jeremiah",
    "otReference": "Jeremiah 31:31-33",
    "otText": "The days are coming, declares the LORD, when I will make a new covenant with the people of Israel... I will put my law in their minds and write it on their hearts. I will be their God, and they will be my people.",
    "historicalContext": "Jeremiah prophesied during the darkest time of Israel's history, yet promised a future New Covenant that would surpass the Mosaic Covenant.",
    "howItPointsToJesus": "Jesus inaugurated this New Covenant at the Last Supper: 'This cup is the new covenant in my blood.' The Old Covenant was written on stone tablets (external); the New Covenant is written on hearts (internal) by the Holy Spirit. Jesus fulfilled what the Law could not - transforming hearts from within. This is the covenant we live under today.",
    "keyInsights": [
      "New Covenant through Jesus' blood",
      "Law written internally, not externally",
      "Personal relationship with God",
      "Sins forgiven and forgotten"
    ]
  }
]